Revit 2026 API

# RebarHandleNameData Class

---

This class is used to contain the information about the rebar handle name defined by an external application.

SystemObject Autodesk.Revit.DB.StructureRebarHandleNameData

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarHandleNameData : IDisposable
```
```vb
Public Class RebarHandleNameData
	Implements IDisposable
```
```cpp
public ref class RebarHandleNameData : IDisposable
```
```fsharp
type RebarHandleNameData =
    class
        interface IDisposable
    end
```

The RebarHandleNameData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarHandleNameData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCustomHandleTag | Gets the handle tag for which we need to specify the name. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetCustomHandleName | Sets the name of the handle. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace